
bbag_role = 601017010012553216 # роли
dmh_role = 393305847930945536
bot_role = 262672084965130240

congrats = 317920843210686464
bottle_role = 934884057161035837

bbag = 262289366041362432 # сервера
dmh = 388139365471354880
garbage1 = 822075570006654976
garbage2 = 825828485401804830
runeguild = 832965689173344276
guildsave_pic_blacklist = (bbag, garbage2)

nikkis = (624624969661284353, 825838904878825513, 825838958537080893, 825839274343530496)
transchan = 825840995563733022

memlog = 676413508832854026 # каналы
mlinput = (624624969661284353, 666100469650685982)
ilinput = (624624969661284353, 666100469650685982, 388321118269734922, 596449475656941588)

programistishe = 767757224051212308
bbagmain = 923693557053796354
oldchannels = [658827819614470146, 601016625482956800, 792154078532206593]
monopolishe = 829638646726000641

taisetsu = 388321118269734922
akaricage = 658773734219317258

bbagpics = 822075632837328956
enpics = 822161720578539551
botcage = 823312775468023858
vkchannel = 823578461045784626
runechannel = 832965689865928766
merchannel = 937176034976084029

prefix = ';'
vk_prefix = '/'
cogs = ['Funx', 'GenX', 'Monopoly', 'Tables', 'Pong']

# colors
raincolors = (0xff0000, 0x8b0000, 0xcd5c5c, 0xff1493,
              0xff4500, 0xffa000, 0xffd700, 0xffff00,
              0xee82ee, 0x9400d3, 0x8b008b, 0x4b0082,
              0xccff00, 0x00ff00, 0x00ff7f, 0x006400,
              0x08e8de, 0x00bfff, 0x2c75ff, 0x00008b,
              0xb8860b, 0xd2691e, 0x8b4513, 0x808000, 0xf0e68c, 0xffd1b8)

colnames = {'бирюзовый': (0, 128, 128), 'розовый': (255, 20, 147), 'персиковый': (240, 128, 128), 'малиновый': (220, 20, 60),
            'фиолетовый': (128, 0, 128), 'жёлтый': (255, 255, 0), 'желтанжевый': (255, 192, 0), 'оранжевый': (255, 128, 0),
            'тёмно-синий': (0, 0, 128), 'синий': (0, 0, 225), 'голубой': (135, 208, 250), 'красный': (255, 0, 0),
            'тёмно-красный': (128, 0, 0), 'зелёный': (64, 255, 64), 'салатовый': (128, 255, 128), 'чёрный': (0, 0, 0),
            'коричневый': (96, 38, 0), 'серый': (128, 128, 128), 'белый': (255, 255, 255)}

# phrases
catch = (('vek', '100', 'вечность'),
         ('sleep', '70', 'спать', 'сплю', 'спишь'),
         ('stol', '20', 'пиздец'),
         ('beda', '70', 'голова', 'дурка'),
         ('iq', '80', 'iq', 'айкью'),
         ('p', '5', 'програм'),
         ('pp', '100', 'парное програм'),
         ('hello', '100', '👋'))

greets = ('Прррривет', 'Меня зовут Akari', 'Доброго времени суток!', 'Готов к работе!', 'Блядский Бот-попугай',
          'Я пришёл убить твою семью', 'Опа ща перья полетят', 'Пришёл клевать вам глаза', 'Осуществляю сбор налогов',
          'Я убил Кар-Карыча', 'Красная смерть', 'Я плюну в тебя', 'Включил компьютер — включи мозги!',
          'Я включаюсь, а твоя голова ещё нет', 'Чего сидишь, иди работай!', 'Я выпотрошу тебе череп',
          'Я стал ещё злее. И ещё сильнее!')
clears = ('Стёр с лица Земли', 'Очистка чатика:', '**СЕБЯ УДАЛИ**', 'УНИЧТОЖИЛ', 'Вытер чат:', 'Постирал долину из') # ... 5 сообщений
veks = ('Сейчас', 'Вы попали в', '**БуДуЩеЕ** наступило!', 'Я забросил вас в', 'Текущая дата') # ... MMXIX век
hours = ('На часах', 'Часы показывают', 'На циферблате', 'Часы бьют', 'Стрелки часов указывают на') # ... 15:05
helps = ('Сами догадаться не можете', 'Мои команды', 'Я ручной ~~пёс~~ попугай', 'Гуманитарная помощь')
dmhelps = ('Секретные команды', 'Welcome to the Secret Shop', 'Тайная комната Админа')
garbage = ('Бесполезный мусор', 'Шлакоблокунь', 'Зачем это?', 'Не использовать', 'Поаккуратнее с этим', 'Не работает',
           'Оно работает?', 'Старая рухлядь', 'Не трогали тысячу лет', 'Только плесень убрать')
uptimes = ('Я живой уже', 'Без проишествий уже', 'Меня не убивали') # ... 5 часов
stoliki = ('┬─┬ ノ( ゜-゜ノ)', '(╯°□°）╯︵ ┻━┻', '(┛◉Д◉)┛彡┻━┻', '(┛ಸ_ಸ)┛彡┻━┻', '(ﾉ≧∇≦)ﾉ ﾐ ┸━┸',
           '┻━┻ミヽ(ಠ益ಠ)ノ彡┻━┻', '─=≡Σ((((╯°□°）╯︵ ┻━┻', '(ﾉ｀A”)ﾉ ⌒┫ ┻ ┣ ┳☆(x x)', '༼ﾉຈل͜ຈ༽ﾉ︵┻━┻',
           '(ノ￣皿￣）ノ ⌒=== ┫', '(ﾉ>｡<)ﾉ.::･┻┻☆()ﾟOﾟ)', '┻━┻︵└(´▃｀└)')
sleep = ('Спокойной ночи', 'Сладких снов', 'Надеюсь, тебе приснится смерть', 'Уже утро? А спать когда? Ложись сейчас',
         'Просто напоминаю, что спать меньше 8 часов — это жесть', 'Ты ещё не спишь? Спи, или я засуну твою голову тебе в рот',
         'Я не спал 502 часа и чувствую себя прекрасно') # ... , Дима
typing = (' что-то там пишет', ', кому пишешь в 3 часа ночи!? Или сколько там...', ', печатаешь, я всё видел!',
          ', хватит строчить!', ', не отправляй это')
letter = ('Сообщение в', 'Послание из', 'Крутая посылка из', 'Нам письмо прислали, интересно, кто?')
businesses = ('Дела делишки', 'Астрономический список дел', 'Когда я всё это должен делать?',
              'Когда-нибудь в сутках будет 30 часов...')
business = ('Дело', 'Протокол', 'Задача', 'Цель', 'Приказ', 'Ваше желание')

blackouts = ('ЗРЯ ВЫ ПРОБУДИЛИ ДРЕВНЕГО ПОПУГАЯ', 'Моё второе имя — Дон ДИАБЛО')
whiteouts = ('Возвращаю всё на круги своя', 'Делаю небо белым, чистым и красивым', 'Белая горячка')
paintlist = ('Побитые парни', 'Им разукрасили лица', 'ОКРАШЕНО')
restlist = ('Оставшиеся за бортом', 'Неприглашённые на бал', 'Найденные в канаве', 'Двери для них закрыты',
            'Разыскиваются', 'Упустили шанс')
calling = ('теперь зовётся', 'кличется', 'награждается именем', 'отныне будет называться', 'as known as',
           'превратился в', 'именуется', 'известен под ником')
garpeople = ('Корм акулам', 'Отброс общества', 'Ничтожество', 'Вас нет в списке', 'Мусорный бак', 'Абалдуй',
             'Просто мясо', 'Низший слой')
people = ('Красавчик', 'Дайте ему медаль', 'Вселенная любит его', 'Бог рандома', 'Гений драфта', 'Отец русской науки')

adjs = ('Тёмн', 'Пожил/ой', 'Красив', 'Изящн', 'Капустн', 'Криворук/ий', 'Аллотропн', 'Ректальн', 'Морковн',
        'Углеродн', 'Квантов', 'Кирпичн', 'Древн/ий/яя', 'Снежн', 'Дыряв', 'Уранов', 'Азотн', 'Серн', 'Полониев',
        'Тухл', 'Арктическ/ий', 'Бетонн', 'Кротов', 'Колбасн', 'Весёл', 'Мясн/ой', 'Мифрилов', 'Легендарн',
         'Восьмибитн')
prefs = ('Мега', 'Гига', 'Мета', 'Квази', 'Супер', 'Гипер', 'Ультра', 'Шлако', 'Мезо', 'Микро', 'Электро', 'Громо',
         'Гидро', 'Авто', 'Пере', 'Крипто', 'Термо', 'Чипсо', 'Нано', 'Урал', 'Кибер', 'Пьезо', 'Хлебо', 'Нео', 'Пиццо',
         'Турбо', 'Флаксо', 'Вазо', 'Борще', 'Просто', 'Кошко', 'Полу', 'Болото')
nouns = ('Ящер', 'Гибон', 'Бот', 'Жмых', 'Фотон', 'Анализатор', 'Шлак', 'Бидон', 'Бозон', 'Суп', 'Шмат', 'Захват',
         'Перелом', 'Крипер', 'Твикс', 'Квас', 'Лист', 'Демон', 'Глист', 'Пистолет', 'Стул', 'Феникс', 'Дух', 'Гелий',
         'Нос', 'Чипс', 'Гений', 'Кроссовок', 'Блок', 'Киборг', 'Медведь', 'Дракон', 'Аппендикс', 'Ведьмак', 'Доширак',
         'Валенок', 'Ход', 'Шуруп')
nounsf = ('Вода', 'Гвардия', 'Жопа', 'Каталка', 'Машина', 'Крольчиха', 'Виверна', 'Жучара', 'Плазма', 'Квартира',
          'Жена')
ends = ('03', 'T-1000', 'U-50', '4', '3000', 'Криспи', 'Огня', 'Воды', 'Воздуха', 'Земли', 'Сральника', 'Смерти',
        'Жизни', 'Тьмы', 'Света', 'Времени')

prcatch = ('ЧЁ, ПРОГРАММИСТЫ, ПРОГРАММИРУЕТЕ ТУТ? ЕБА, Я ТОЖЕ УМЕЮ:', 'АГА, ПРОГРАММИСТЫ СОБРАЛИСЬ, НУ ЩА ПОКАЖУ ЧТО НАПИСАЛ Я:', 'КТО-ТО СКАЖЕТ ГОВНОКОД', 'ТВОЙ РОДНОЙ ЯЗЫК ДЖАВАСКРИПТ ЧТО ЛИ СУКА', 'КАК ЕБАНУ SYNTAX ERROR')
ttss = ('Ваша болтовня', 'Записал хуйню', 'Сделал новый бит')
exp_removes = ('Устррранить корррупцию!', 'Упс... Кто-то случайно получил лишний опыт...')
changenicks = ('Ваши предыдущие ники', 'Ваши прошлые жизни', 'Предыдущие реинкарнации тебя')

bottles = ('cum', 'молоком', 'пивом', 'хуями', 'гниющей водой', 'плавленным сыром', 'какао', 'кактусами', 'салом', 'китайской лапшой', 'лавой')
fillers = (':milk:', ':baby_bottle:', ':beers:', '<:Elda:822138654620254208>', ':potable_water:', ':cheese:', '🍫', '🌵', ':flag_ua:', '🥡', '🪔')

achieves = [{'counts': [1000, 2000, 5000, 8000, 12000, 16000, 20000], 'addcount': 5000, 'stat': 'allmessages', 'name': 'messages', 'title': 'Сообщения', 'desc': 'Вы настрочили {0} сообщений', 'icon': 'mes'},
            {'counts': [20, 40, 60, 80, 100], 'addcount': 25, 'stat': 'exp', 'name': 'levels', 'title': 'Опыт', 'desc': 'Вы достигли {0} уровня', 'icon': 'exp'},
            {'counts': [1000, 2500, 4000, 6000, 8000, 10000, 14000, 18000, 22000, 26000, 30000], 'addcount': 5000, 'stat': 'pictures', 'name': 'pictures', 'title': 'Картинки', 'desc': '{0} мемчиков отправлено в чат', 'icon': 'pics'},
            {'counts': [200, 400, 600, 800, 1000, 1300, 1600], 'addcount': 400, 'stat': 'mentions', 'name': 'mentions', 'title': 'Упоминания', 'desc': 'Вы пинганули {0} человек', 'icon': 'mens'},
            {'counts': [100, 200, 300, 400, 600, 800, 1000, 1200, 1400, 1600, 1800, 2000], 'addcount': 250, 'stat': 'smiles', 'name': 'smiles', 'title': 'Смайлы', 'desc': '{0} эмодзи в чатике', 'icon': 'emos'},
            {'counts': [500, 1000, 1500, 2000, 2500, 3000, 3500, 4000, 4500, 5000, 5500, 6000], 'addcount': 1000, 'stat': 'mat', 'name': 'mat', 'title': 'Мат', 'desc': 'Чисто наругался {0}', 'icon': 'mat'},
            {'counts': [10800], 'addcount': 10800, 'stat': 'online', 'name': 'online', 'title': 'Время онлайн', 'desc': 'Вы просидели {0} минут онлайн', 'icon': 'online'},
            {'counts': [10000, 25000, 50000, 100000], 'addcount': 100000, 'stat': 'symbols', 'name': 'symbols', 'title': 'Символы', 'desc': 'Вы настрочили {0} символов', 'icon': 'syms'},
            {'counts': [25, 50, 100, 150, 200], 'addcount': 100, 'stat': 'selfsmiles', 'name': 'selfsmiles', 'title': 'Смайлы самого себя', 'desc': 'ЧСВ-Печь на {0}W', 'icon': 'selfsmiles'},
            {'counts': [10], 'addcount': 10, 'stat': 'bottles', 'name': 'bottles', 'title': 'Бутылки', 'desc': 'Вы присели {0} раз', 'icon': 'bottle'},
            {'counts': [10], 'addcount': 10, 'stat': 'dayphrases', 'name': 'dayphrase', 'title': 'Фразы дня', 'desc': 'Вы попали на показ цитат {0} раз', 'icon': 'dayphrases'},
            {'counts': [150, 300], 'addcount': 300, 'stat': 'vkmes', 'name': 'vkmes', 'title': 'Сообщения ВК', 'desc': '{0} сообщений ВК, а что?', 'icon': 'vkmes'}]

sum_achieves = [{"stat": "exp", "levelvalue": 5000000, "name": "sum_exp", "title": "Общий опыт", "desc": "Получена {0}-ая единица опыта"},
                {"stat": "allmessages", "levelvalue": 10000, "name": "sum_mes", "title": "Общие сообщения", "desc": "Написано {0}-ое сообщение"},
                {"stat": "pictures", "levelvalue": 5000, "name": "sum_pics", "title": "Общие картинки", "desc": "Отправлена {0}-ая картинка"},
                {"stat": "mentions", "levelvalue": 1000, "name": "sum_mens", "title": "Общие упоминания", "desc": "Сделано {0}-ое упоминание"},
                {"stat": "smiles", "levelvalue": 1000, "name": "sum_emos", "title": "Общие смайлы", "desc": "Поставлен {0}-ый смайлик"},
                {"stat": "vkmes", "levelvalue": 500, "name": "sum_vkmes", "title": "Общие сообщения ВК", "desc": "Написано {0}-ое сообщение ВК"},
                {"stat": "mat", "levelvalue": 1000, "name": "sum_mat", "title": "Общая нецензурная лексика", "desc": "{0} раз АНИМЕ"},
                {"stat": "symbols", "levelvalue": 150000, "name": "sum_syms", "title": "Общие символы", "desc": "Тыкнуто {0} букв, цифр и значков на клавиатуре"},
                {"stat": "selfsmiles", "levelvalue": 200, "name": "sum_selfsmiles", "title": "Общие смайлы себя", "desc": "Мы накидали {0} смайлов самих себя"},
                {"stat": "online", "levelvalue": 72000, "name": "sum_online", "title": "Общее время онлайн", "desc": "Мы сидим здесь {0} минут!!!"}]

versions = {32:[['Haidori Bot has come!', 'Объединяет <:vk:826276197921980446> и Discord в единую сеть'], ['Бутылка дня', 'Ежедневный розыгрыш призов 🍾'], ['Мем дня', 'Случайный мем из BBAG\'овских (Лёше уже не понравилось)'],
                [f'Команда {prefix}r <текст>', 'Пишет текст наоборот'], [f'Команда {prefix}vk <текст>', 'Отправляет сообщение в беседу <:vk:826276197921980446>'], ['Обновления', 'Сообщения о патчноутах с красивыми попугаями']],
            321:[['Система достижений', 'Получайте ачивки за всякую фигню'], [f'Команда {prefix}coder', 'Бот умеет программировать'],
                 [f'{prefix}leha и {prefix}bigleha', 'Призывает Лёху в чат'], [f'Команда {prefix}emoji <название>', 'Вызывает любой эмодзи, даже старый или премиумный'], [f'Команда {prefix}trans <ссылка> [язык]', 'Переводит сообщение (по умолчанию на русский)']],
            322:[['Больше статистики', 'Теперь мы собираем больше данных о вас'], [f'Команда {prefix}tts', 'Вот что я люблю'], [f'Команды для беседы ВК', f'Имеют префикс {vk_prefix}'], [f'Команда ВК {vk_prefix}ds', 'Отправляет сообщение угадайте куда?'], [f'Команда ВК {vk_prefix}tts', 'Голосовое сообщение'], ['Общая статистика', 'Посмотрите, сколько мы вместе тут насрали']]}
add_versions = {1: [['Haidori Bot has come!', 'Объединяет <:vk:826276197921980446> и Discord в единую сеть'], [f'Команда {prefix}vk <текст>', 'Отправляет сообщение в беседу <:vk:826276197921980446>']]}
ver_footer = {32:'©Akari 3.2 of 20.03.2021', 321:'©Akari 3.2.1 of 27.03.2021', 322:'©Akari 3.2.2 of 31.03.2021'}

eng = ('q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p', '[', ']', 'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', ';', "'", 'z', 'x', 'c', 'v', 'b', 'n', 'm', ',', '.', '`')
rus = ('й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ', 'ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э', 'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю', 'ё')
engb = ('Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', '{', '}', 'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', ':', '"', 'Z', 'X', 'C', 'V', 'B', 'N', 'M', '<', '>', '~')
rusb = ('Й', 'Ц', 'У', 'К', 'Е', 'Н', 'Г', 'Ш', 'Щ', 'З', 'Х', 'Ъ', 'Ф', 'Ы', 'В', 'А', 'П', 'Р', 'О', 'Л', 'Д', 'Ж', 'Э', 'Я', 'Ч', 'С', 'М', 'И', 'Т', 'Ь', 'Б', 'Ю', 'Ё')
checks = ((0, 1), (-1, 0), (0, -1), (1, 0), (-1, 1), (1, 1), (-1, -1), (1, -1))

# defs
import random
import discord
from collections import Counter
import math
import os
import time
import re
import functools

if os.path.exists('pips'):
    rusdict = open('pips/engwords.txt', 'r', encoding='utf-8').read().split('\n')
    engdict = open('pips/ruswords.txt', 'r', encoding='utf-8').read().split('\n')


def ti(func):
    def wr(*args, **kwargs):
        t = time.perf_counter()
        a = func(*args, **kwargs)
        print(time.perf_counter()-t)
        return a
    return wr


def postfix(v, ps, rv=True):
    if v % 10 in (0, 5, 6, 7, 8, 9) or v % 100 in (11, 12, 13, 14):
        p = ps[2]
    elif v % 10 == 1:
        p = ps[0]
    else:
        p = ps[1]
    if rv: return f'{v} {p}'
    return p


def list_from_str(s: str):
    return s.split(']')[0].replace('[', '').replace('\'', '').replace('\"', '').split(', ')


def chance(a, b=100):
    return random.randint(1, b) <= a


def chancelist(v, c):
    s = sum(c)
    r = random.randint(1, s)
    for i in range(len(v)):
        if r > c[i]:
            r -= c[i]
        else:
            return v[i]


def sevranchoice(li, i: int):
    l = list(li)
    a = []
    while i >= len(l):
        a += l
        i -= len(l)
    a += random.sample(li, i)
    random.shuffle(a)
    return a


def randomnick(type=0, c=None):
    if not c:
        c = [35, 35, 25, 5]
    if type == 0:
        type = chancelist([1, 2, 3, 4], c)

    a = random.choice(adjs)
    if chance(len(nouns), len(nouns + nounsf)):
        a = corradj(a)
        n = random.choice(nouns)
    else:
        a = corradj(a, 'f')
        n = random.choice(nounsf)
    p = random.choice(prefs)
    e = random.choice(ends)

    if type == 1:
        rn = f'{p}{n.lower()} {e}'
    elif type == 2:
        rn = f'{a} {p}{n.lower()}'
    elif type == 3:
        rn = f'{a} {n} {e}'
    else:
        rn = f'{a} {p}{n.lower()} {e}'
    return rn


def randomnicks(type=0, c=None, nicks=2):
    if not c:
        c = [35, 35, 25, 5]
    if type == 0:
        type = [chancelist([1, 2, 3, 4], c) for _ in range(nicks)]
    else:
        type = [type for _ in range(nicks)]

    a = sevranchoice(adjs, nicks)
    p = sevranchoice(prefs, nicks)
    e = sevranchoice(ends, nicks)
    nm = round((len(nouns) / len(nouns + nounsf)) * nicks)
    nf = nicks - nm
    n = sevranchoice(nouns, nm) + sevranchoice(nounsf, nf)
    for i in range(nm):
        a[i] = corradj(a[i])
    for i in range(nm, nicks):
        a[i] = corradj(a[i], 'f')

    rn = []
    for i in range(nicks):
        if type[i] == 1:
            rn.append(f'{p[i]}{n[i].lower()} {e[i]}')
        elif type[i] == 2:
            rn.append(f'{a[i]} {p[i]}{n[i].lower()}')
        elif type[i] == 3:
            rn.append(f'{a[i]} {n[i]} {e[i]}')
        else:
            rn.append(f'{a[i]} {p[i]}{n[i].lower()} {e[i]}')
    random.shuffle(rn)
    return rn


def corradj(a, sex='m'):
    if '/' in a:
        a = a.split('/')
        if sex == 'm' and a[1] != '':
            return a[0] + a[1]
        elif sex == 'f' and len(a) > 2:
            return a[0] + a[2]
        a = a[0]
    if sex == 'm':
        return a + 'ый'
    if sex == 'f':
        return a + 'ая'


def to_roman(number):
    out = ''
    book = ((1000, 'M'), (900, 'CM'), (500, 'D'), (400, 'CD'), (100, 'C'), (90, 'XC'), (50, 'L'), (40, 'XL'),
            (10, 'X'), (9, 'IX'), (5, 'V'), (4, 'IV'), (1, 'I'))
    while number > 0:
        exit = False
        for i in book:
            if exit == True:
                break
            if number >= i[0]:
                out += i[1]
                number -= i[0]
                exit = True
                break
    return out


def vis(god):
    return (god % 4 == 0 and god % 100 != 0) or god % 400 == 0


def day_to_day(day, year=1):
    a = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31]
    if vis(year):
        a[1] = 29
    names = ['Января', 'Февраля', 'Марта', 'Апреля', 'Мая', 'Июня', 'Июля', 'Августа', 'Сентября', 'Октября', 'Ноября',
             'Декабря']
    for i in range(12):
        if day > a[i]:
            day -= a[i]
        else:
            return f'{day} {names[i]}'


def levelmode(x, mode=0):
    if mode == 0:
        return 2700 * x ** 1.5527
    elif mode == 1:
        return 15 * x ** 2.5
    elif mode == 2:
        return 6005 * x ** 1.4


def levelget(exp, mode=0, all=None):
    x = 1
    lvlexp = levelmode(1, mode)
    while True:
        if exp > lvlexp:
            exp -= lvlexp
            x += 1
            lvlexp = levelmode(x, mode) - levelmode(x - 1, mode)
        elif all:
            return [x, int(exp), int(lvlexp)]
        else:
            return x


def uniquesum(l):
    new = []
    dinds = []
    index = -1
    for i in range(len(l)):
        if l[i] not in dinds:
            index += 1
            new.append(l[i])
            dinds.append(l[i])
            for j in range(i + 1, len(l)):
                if l[i] == l[j]:
                    new[index] += l[j]
    return new


def ownname(d):    #принимает collections.Counter
    del d['']      #код предотвращает понижение регистра имён собственных в словаре
    for a in d:    #рассчитан на английский, русский и итальянский языки
        if (ord(a[0]) in range(65,91) or ord(a[0]) in range(1040, 1072)) and a.lower() in d:
            d[a.lower()] += d[a]
            d[a] = 0
    d += Counter()
    return d


def mode(l):
    un = list(set(l))
    co = [l.count(x) for x in un]
    print(un, '\n', co)
    return un[co.index(max(co))]


def listsplit(f, cc=10):
    r = []
    while len(f) > 0:
        if len(f) < cc:
            r.append(f)
            f = []
        else:
            r.append(f[:cc])
            f = f[cc:]
    return r


def sort(l):
    a = [v for v in l]
    for i in range(len(a) - 1):
        for j in range(len(a) - i - 1):
            if a[j] < a[j + 1]:
                a[j], a[j + 1] = a[j + 1], a[j]
    return a


def esort(l, param):
    a = [v for v in l if v[param] != 0]
    for i in range(len(a) - 1):
        for j in range(len(a) - i - 1):
            if a[j][param] < a[j + 1][param]:
                a[j], a[j + 1] = a[j + 1], a[j]
    return a


def esort_ext(l, param, secc, svalue):
    a = [l[v] for v in l if l[v][param] != 0 and l[v][secc] == svalue]
    for i in range(len(a) - 1):
        for j in range(len(a) - i - 1):
            if a[j][param] < a[j + 1][param]:
                a[j], a[j + 1] = a[j + 1], a[j]
    return a


def esortatte(l, attr, rev=False):
    a = [v for v in l if getattr(v, attr) != 0]
    for i in range(len(a) - 1):
        for j in range(len(a) - i - 1):
            if getattr(a[j], attr) > getattr(a[j+1], attr):
                a[j], a[j + 1] = a[j + 1], a[j]
    if rev:
        return a[::-1]
    return a


def longsplit(mes, n=1800):
    return [mes[i:i+n] for i in range(0, len(mes), n)]


def longsplit_lines(lst, n=1800, sep='\n'):
    res = []
    i = 0
    s = ''
    while i < len(lst):
        while i < len(lst) and len(s)+len(lst[i])+1 < n:
            if s:
                s += sep
            s += lst[i]
            i += 1
        res.append(s)
        s = ''
    return res


def ranget(l, c=1):
    return ', '.join([random.choice(l) for _ in range(c)])


def matcounter(text):
    return re.findall(r'ху[уюйияеё]|еб[аиоукнлсты]|ёб[аиоукнлсты]|д.лб[аоыьеёи]|[даыьъо][её]б|еб[её][тцмш]|еб[её]н[ьяеин]|сц?[уы][кч4]|бл[яэ]|г.ндон|г.вн|моча|жоп|п[еёи]зд|cum|конч|с[сц]ц?[уаы]|манд|минет|бзд.|др[ие]с[тн]|сра[ткл]|хер|пид.р|fuck|cunt|cock|др[ао][тч]|перд|св[ао]л[ао]|елда|муд[аиое]|з[ао]луп|п.т[ao]ску|трах.|фак|п.скуд|балбес|.н.ме', text.lower())


def matcounter2(text):
    return re.findall(r'[хxh][уyu][уyюйиuiяеeё]|[еe][б6b][аa@uio0иоуyкkнhnlлсcтыbь]|ё[б6b][аa@uio0иоуyкkнhnlлсcтыbь]|д.л[б6b][аa@o0оыbьееёиui]|[дdаa@ыьъo0о][еeё][б6b]|[еe][б6b][ееё][тцмш]|[еe][б6b][ееё]н[ьbяееиuiн]|[сc]ц?[уyыb][кч4]|[б6b]л[яэ]|г.ндон|г.вн|моч[аa@]|жоп|п[ееёиui]зд|cum|конч|[сc][сcц]ц?[уyаa@ыb]|м[аa@]нд|м[иui]н[еe]т|[б6b]зд.|др[иuiее][сc][тн]|[сc][иui]р[ыьbаa@][ткл]|[сc]р[аa@][ткл]|[хxh][еe]р|п[иui]д.р|fu[сc]k|[сc]unt|[сc]ock|др[аa@o0о][тч]|п[еe]рд|св[аa@o0о]л[аa@o0о]|[еe]лд[аa@]|муд[аa@иuio0оeе]|з[аa@o0о]луп|п.т[аa@o0о]ску|тр[аa@]х.|ф[аa@]к|п.скуд', text.lower())


def switch_lang(text):
    return ''.join([eng[rus.index(i)] if i in rus else engb[rusb.index(i)] if i in rusb else i for i in text]) if sum([text.count(i) for i in rus+rusb]) >= sum([text.count(i) for i in eng+engb]) else ''.join([rus[eng.index(i)] if i in eng else rusb[engb.index(i)] if i in engb else i for i in text])


def switch(text):
    return ''.join([eng[rus.index(i)] if i in rus else engb[rusb.index(i)] if i in rusb else rus[eng.index(i)] if i in eng else rusb[engb.index(i)] if i in engb else i for i in text])


def find_word(word):
    return word in rusdict or word in engdict


def replace_reg(match, repl_pattern):
    repl = ''.join([r_char if m_char.islower() else r_char.upper() for r_char, m_char in zip(repl_pattern, match)])
    repl += repl_pattern[len(match):]
    return repl


def correct_word(word):
    res = None
    for idx, w in enumerate(word[:-1]):
        kb = rus if w in rus else eng if w in eng else None
        if kb is None:
            continue
        kbs = listsplit(kb, 12)
        i, j = divmod(kb.index(w), 12)
        for oi, oj in checks:
            si, sj = i + oi, j + oj
            if not 0 <= si < len(kbs) or not 0 <= sj < len(kbs[si]):
                continue
            ex = word[:idx]+kbs[si][sj]+word[idx+1:]
            if find_word(ex):
                return ex
    return res


def reverse_usability(l):
    return 1-functools.reduce(lambda a, b: a*b, [1-i for i in l])


def is_float(a):
    try:
        float(a)
        return True
    except:
        return False


def pretty_nlp_tag(word, tag):
    return f'{word:<15} | {tag.normal_form:<15} | {tag.pos:<4} | {" | ".join(tag.tag.split("|"))}'.replace("_", '-')


def mceil(a, b):
    return b*math.ceil(a/b)


def stacks(x):
    return x // 64, x % 64


# Файлы и прочее
if os.path.exists('pips'):
    errorpic = discord.File(fp='pips/error.jpg')
    progerpic = discord.File(fp='pips/proger.png')
    cannon = discord.File(fp='pips/uranus.mp4')
    mischat = discord.File(fp='pips/mischat.png')
    iqpic = discord.File(fp='pips/iqpic.png')
    streetracing = discord.File(fp='pips/streetracing.png')
    phrasestxt = open('pips/phrases.txt', encoding='utf-8').readlines()


# Обработка команд бота
calchelp = ('list', '<name>', '<name> <n> [description]', '<name> delete', '<name> delete <i>', '<name> edit<i> <n>',
            '<name> edit<i> desc=<n>', '<name> not<i>')
calchelpdescs = ('Все таблицы', 'Вывод на экран', 'Добавляет элемент', 'Удаляет таблицу', 'Удаляет i элемент таблицы',
                 'Изменяет элемент i', 'Изменяет описание элемента i', 'Выводит и считает все элементы, кроме i')

servicecoms = ('help', 'dmhelp')
botcoms = ('clear', 'blackout', 'colorout', 'whiteout', 'vek', 'uptime', 'stol', 'timer', 'move', 'exp', 'ping',
           'rolelore', 'memeload', 'casino', 'r', 'phrase', 'vk', 'leha', 'bigleha', 'coder', 'emoji', 'trans',
           'tts', 'qui', 'numgif', 'tablehelp', 'nicks', 'cov', 'corona', 'rantime', 'rt')
comdescs = ('Очистка чатика', 'Стандартные ники', 'Рандомные ники всем', 'Возвращем ники на места',
            'Генератор века', 'Время работы', '┬─┬ ノ( ゜-゜ノ)', 'Засекать время', 'Перемещает челиков в войсе',
            'Показывает опыт челика или сервера', 'Проверяет пинг', '&$name$color$members',
            'Загружает мемы из папки на сервер', 'Заролль себе три костыля!', 'Вывести текст наоборот',
            'Добавить новую фразу в блокнот', 'Отправить сообщение в беседу вк', 'Привызвает Лёху в чат',
            'Призывает большого Лёху в чат', 'Рандомный код из кусков Akari', 'Кидает любой эмодзи',
            'Переводит любой текст (по умолчанию на русский)', 'Превращает текст в музыкальный файл',
            'Создаёт опрос', 'Делает гифку с цифрой', 'help для табличного процессора', 'Посмотреть предыдущие ники',
            'Статистика по коронавирусу', 'Статистика по коронавирусу', 'Даёт время на прокрастинацию',
            'Даёт время на прокрастинацию')
dmcoms = ('calc', 'chencounter', 'nikki', 'aesave', 'channelexp', 'aerecount', 'felete', 'channelsave',
          'lognull', 'imacoder', 'guildsave', 'newemoji', 'remind', 'transfer', 'vksend', 'bottle',
          'randomplay', 'musplay', 'removeexp', 'whereami', 'bottleregen')
dmdescs = ('Калькулятор/счётчик чего-угодно', 'Статистика в канале', 'Новая неделя!', 'Сохраняем прогресс',
           'Сколько опыта в этом канале', 'Опасно! Пересчитывает опыт', 'Удаляет файл', 'Сохранение истории канала',
           'Вывод лога печати на DMH', 'Аминь', 'Ложит весь сервер', 'Добавить новую эмодзи в БД', 'Напоминалочка',
           'Перенести сообщения в другой канал', 'Отправить сообщение Диме в ВК', 'Сажает на бутылку нового человека',
           'Играет рандомный звук', 'Играет звук по названию', 'Убирает лишний опыт))',
           'Показывает, где запущен бот(ы)', 'Перегенерирует роль бутылки')
vkcoms = ('ds', 'tts')
vkdescs = ('Отправляет сообщение в Дискорд от вашего имени', 'Голосовое сообщение с вашим текстом')

allcoms = servicecoms + botcoms + dmcoms
# Опыт
e_savetime = 2
e_onlinetime = 5
e_online = 50
e_message = 250
e_picture = 300
e_men = 90
e_emo = 120
e_vkstick = 120
e_dayphrase = 5000
e_bottle = 10000
e_ach = 20000
e_ach_lvladd = 1000
e_sumach = 40000
e_sumach_lvladd = 500


ek_congrats = 4
ek_bottle = 3

reminder_cd = 50

cas_cd = 60

cas_reward = {'<:velosiped:934631339133665320>': 10000, '<:UebuSuka:655488680080965634>': 20000,
            '<:TemaOr:605323006310612992>': 30000, '🧀': 5000, '💗': 15000, '🛺': 7500}
reload = '<:reload:849129952707870760>'

nexus_on = False
if_host = 'coconut.png' in os.listdir('.')

print(time.strftime("%d.%m.%Y, %X", time.localtime()))


monop_maps = {}
monop_maps[0] = [[2,1,1,4,1,1,1,3,1,1,1,4,1,1,1,2],
                 [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1],
                 [4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3],
                 [1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1],
                 [1,0,0,0,0,0,0,0,0,0,2,1,4,1,1,2],
                 [1,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0],
                 [3,0,0,0,0,0,0,0,0,0,1,0,5,5,5,0],
                 [1,0,0,0,0,0,0,6,6,0,1,0,5,5,5,0],
                 [4,0,0,0,0,0,0,0,0,0,1,0,5,5,5,0],
                 [2,1,3,1,1,1,3,1,1,1,4,0,0,0,0,0]]

monop_maps[1] = [[0,0,1,2,1,1,0,0,0,0,0,4,1,1,1,0,0],
                 [0,1,0,0,0,0,1,0,0,0,1,0,0,0,0,2,0],
                 [3,0,0,0,0,0,0,2,0,2,0,0,5,5,0,0,1],
                 [1,0,0,6,6,0,0,0,3,0,0,0,5,5,0,0,1],
                 [1,0,0,0,0,0,0,1,0,1,0,0,5,5,0,0,3],
                 [0,2,0,0,0,0,1,0,0,0,1,0,0,0,0,1,0],
                 [0,0,1,1,1,4,0,0,0,0,0,1,4,1,1,0,0]]

monop_maps[2] = [[0,0,0,1,1,2,0,0,0],
                 [0,0,3,0,0,0,1,0,0],
                 [0,0,1,0,0,0,1,0,0],
                 [0,0,1,0,0,0,1,0,0],
                 [0,0,1,6,0,0,3,0,0],
                 [0,0,4,6,0,0,1,0,0],
                 [0,0,2,0,0,0,4,0,0],
                 [0,0,1,0,0,0,1,0,0],
                 [0,0,1,0,0,0,1,0,0],
                 [0,0,3,0,0,0,2,0,0],
                 [0,0,1,0,0,0,1,0,0],
                 [0,0,1,0,0,0,1,0,0],
                 [0,0,1,0,0,0,1,0,0],
                 [0,1,2,0,0,0,2,1,0],
                 [1,5,5,1,1,1,5,5,1],
                 [1,5,5,1,0,1,5,5,1],
                 [0,1,4,0,0,0,4,1,0]]


monop_prefs = {0: [32, 5, 5, 6, 9, (16, 10)], 1: [23, 5, 3, 3, 6, (17, 7)], 2: [32, 5, 3, 4, 8, (9, 17)]}

monop_cubes = {0: [(6,12), (6,13), (6,14), (7,12), (7,13), (7,14), (8,12), (8,13), (8,14)], 1: [(2,12), (2,13), (3,12), (3,13), (4,12), (4,13)], 2: [(14, 1), (14, 2), (15, 1), (15, 2), (14, 6), (14, 7), (15, 6), (15, 7)]}

monop_cube_nums = {0: [(7,7), (7,8)], 1: [(3,3), (3,4)], 2: [(4, 3), (5, 3)]}

monop_sequences = {0: [(0,0), (0,1), (0,2), (0,3), (0,4), (0,5), (0,6), (0,7), (0,8), (0,9), (0,10), (0,11), (0,12),
                       (0,13), (0,14), (0,15), (1,15), (2,15), (3,15), (4,15), (4,14), (4,13), (4,12), (4,11), (4,10),
                       (5,10), (6,10), (7,10), (8,10), (9,10), (9,9), (9,8), (9,7), (9,6), (9,5), (9,4), (9,3), (9,2),
                       (9,1), (9,0), (8,0), (7,0), (6,0), (5,0), (4,0), (3,0), (2,0), (1,0)],
                   1: [(2,7), (3,8), (4,9), (5,10), (6,11), (6,12), (6,13), (6,14), (5,15), (4,16), (3,16), (2,16),
                       (1,15), (0,14), (0,13), (0,12), (0,11), (1,10), (2,9), (3,8), (4,7), (5,6), (6,5), (6,4),
                       (6,3), (6,2), (5,1), (4,0), (3,0), (2,0), (1,1), (0,2), (0,3), (0,4), (0,5), (1,6)],
                   2: [(0,5), (1,6), (2,6), (3,6), (4,6), (5,6), (6,6), (7,6), (8,6), (9,6), (10,6), (11,6), (12,6),
                       (13,6), (13,7), (14,8), (15,8), (16,7), (16,6), (15,5), (14,5), (14,4), (14,3), (15,3), (16,2),
                       (16,1), (15,0), (14,0), (13,1), (13,2), (12,2), (11,2), (10,2), (9,2), (8,2), (7,2), (6,2),
                       (5,2), (4,2), (3,2), (2,2), (1,2), (0,3), (0,4)]}
